**Terraform Plan Output (prod):**

```

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.advanced_s3_bucket.aws_s3_bucket.this has been deleted
  - resource "aws_s3_bucket" "this" {
      - arn                         = "arn:aws:s3:::my-advanced-bucket-57984937" -> null
      - bucket_domain_name          = "my-advanced-bucket-57984937.s3.amazonaws.com" -> null
      - bucket_regional_domain_name = "my-advanced-bucket-57984937.s3.ap-south-1.amazonaws.com" -> null
      - hosted_zone_id              = "Z11RGJOFQNVJUP" -> null
      - id                          = "my-advanced-bucket-57984937" -> null
      - region                      = "ap-south-1" -> null
        tags                        = {
            "Environment" = "prod"
            "Name"        = "my-advanced-bucket-57984937"
            "Owner"       = "team-a"
            "Project"     = "advanced-example"
        }
      - tags_all                    = {
          - "Environment" = "prod"
          - "Name"        = "my-advanced-bucket-57984937"
          - "Owner"       = "team-a"
          - "Project"     = "advanced-example"
        } -> null
        # (8 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.basic_s3_bucket.aws_s3_bucket.this has been deleted
  - resource "aws_s3_bucket" "this" {
      - arn                         = "arn:aws:s3:::my-basic-bucket-57984937" -> null
      - bucket_domain_name          = "my-basic-bucket-57984937.s3.amazonaws.com" -> null
      - bucket_regional_domain_name = "my-basic-bucket-57984937.s3.ap-south-1.amazonaws.com" -> null
      - hosted_zone_id              = "Z11RGJOFQNVJUP" -> null
      - id                          = "my-basic-bucket-57984937" -> null
      - region                      = "ap-south-1" -> null
        tags                        = {
            "Environment" = "dev"
            "Name"        = "my-basic-bucket-57984937"
            "Project"     = "example"
        }
      - tags_all                    = {
          - "Environment" = "dev"
          - "Name"        = "my-basic-bucket-57984937"
          - "Project"     = "example"
        } -> null
        # (8 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.website_s3_bucket.aws_s3_bucket.this has been deleted
  - resource "aws_s3_bucket" "this" {
      - arn                         = "arn:aws:s3:::my-website-bucket-57984937" -> null
      - bucket_domain_name          = "my-website-bucket-57984937.s3.amazonaws.com" -> null
      - bucket_regional_domain_name = "my-website-bucket-57984937.s3.ap-south-1.amazonaws.com" -> null
      - hosted_zone_id              = "Z11RGJOFQNVJUP" -> null
      - id                          = "my-website-bucket-57984937" -> null
      - region                      = "ap-south-1" -> null
        tags                        = {
            "Environment" = "prod"
            "Name"        = "my-website-bucket-57984937"
            "Project"     = "website"
            "Type"        = "static-website"
        }
      - tags_all                    = {
          - "Environment" = "prod"
          - "Name"        = "my-website-bucket-57984937"
          - "Project"     = "website"
          - "Type"        = "static-website"
        } -> null
        # (8 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.website_s3_bucket.aws_s3_bucket_website_configuration.this[0] has been deleted
  - resource "aws_s3_bucket_website_configuration" "this" {
        id                    = "my-website-bucket-57984937"
      - website_domain        = "s3-website.ap-south-1.amazonaws.com" -> null
      - website_endpoint      = "my-website-bucket-57984937.s3-website.ap-south-1.amazonaws.com" -> null
        # (4 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.advanced_s3_bucket.aws_s3_bucket.this will be created
  + resource "aws_s3_bucket" "this" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "my-advanced-bucket-57984937"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_region               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = "ap-south-1"
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "prod"
          + "Name"        = "my-advanced-bucket-57984937"
          + "Owner"       = "team-a"
          + "Project"     = "advanced-example"
        }
      + tags_all                    = {
          + "Environment" = "prod"
          + "Name"        = "my-advanced-bucket-57984937"
          + "Owner"       = "team-a"
          + "Project"     = "advanced-example"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # module.advanced_s3_bucket.aws_s3_bucket_cors_configuration.this[0] will be created
  + resource "aws_s3_bucket_cors_configuration" "this" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + region = "ap-south-1"

      + cors_rule {
          + allowed_headers = [
              + "*",
            ]
          + allowed_methods = [
              + "GET",
              + "POST",
              + "PUT",
            ]
          + allowed_origins = [
              + "https://example.com",
            ]
          + expose_headers  = []
            id              = null
          + max_age_seconds = 3000
        }
    }

  # module.advanced_s3_bucket.aws_s3_bucket_lifecycle_configuration.this[0] will be created
  + resource "aws_s3_bucket_lifecycle_configuration" "this" {
      + bucket                                 = (known after apply)
      + expected_bucket_owner                  = (known after apply)
      + id                                     = (known after apply)
      + region                                 = "ap-south-1"
      + transition_default_minimum_object_size = "all_storage_classes_128K"

      + rule {
          + id     = "transition_to_ia"
          + status = "Enabled"
            # (1 unchanged attribute hidden)

          + filter {
              + prefix = "documents/"
            }

          + transition {
              + days          = 30
              + storage_class = "STANDARD_IA"
            }
          + transition {
              + days          = 90
              + storage_class = "GLACIER"
            }
        }
      + rule {
          + id     = "delete_old_versions"
          + status = "Enabled"
            # (1 unchanged attribute hidden)

          + noncurrent_version_expiration {
              + noncurrent_days = 90
            }
        }
    }

  # module.advanced_s3_bucket.aws_s3_bucket_public_access_block.this will be created
  + resource "aws_s3_bucket_public_access_block" "this" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + region                  = "ap-south-1"
      + restrict_public_buckets = true
    }

  # module.advanced_s3_bucket.aws_s3_bucket_server_side_encryption_configuration.this will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "this" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + region = "ap-south-1"

      + rule {
          + apply_server_side_encryption_by_default {
              + sse_algorithm     = "AES256"
                # (1 unchanged attribute hidden)
            }
        }
    }

  # module.advanced_s3_bucket.aws_s3_bucket_versioning.this will be created
  + resource "aws_s3_bucket_versioning" "this" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + region = "ap-south-1"

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

  # module.basic_s3_bucket.aws_s3_bucket.this will be created
  + resource "aws_s3_bucket" "this" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "my-basic-bucket-57984937"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_region               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = "ap-south-1"
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "dev"
          + "Name"        = "my-basic-bucket-57984937"
          + "Project"     = "example"
        }
      + tags_all                    = {
          + "Environment" = "dev"
          + "Name"        = "my-basic-bucket-57984937"
          + "Project"     = "example"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # module.basic_s3_bucket.aws_s3_bucket_public_access_block.this will be created
  + resource "aws_s3_bucket_public_access_block" "this" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + region                  = "ap-south-1"
      + restrict_public_buckets = true
    }

  # module.basic_s3_bucket.aws_s3_bucket_server_side_encryption_configuration.this will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "this" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + region = "ap-south-1"

      + rule {
          + apply_server_side_encryption_by_default {
              + sse_algorithm     = "AES256"
                # (1 unchanged attribute hidden)
            }
        }
    }

  # module.basic_s3_bucket.aws_s3_bucket_versioning.this will be created
  + resource "aws_s3_bucket_versioning" "this" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + region = "ap-south-1"

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

  # module.website_s3_bucket.aws_s3_bucket.this will be created
  + resource "aws_s3_bucket" "this" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "my-website-bucket-57984937"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_region               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = "ap-south-1"
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "prod"
          + "Name"        = "my-website-bucket-57984937"
          + "Project"     = "website"
          + "Type"        = "static-website"
        }
      + tags_all                    = {
          + "Environment" = "prod"
          + "Name"        = "my-website-bucket-57984937"
          + "Project"     = "website"
          + "Type"        = "static-website"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # module.website_s3_bucket.aws_s3_bucket_policy.this[0] will be created
  + resource "aws_s3_bucket_policy" "this" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "s3:GetObject"
                      + Effect    = "Allow"
                      + Principal = "*"
                      + Resource  = "arn:aws:s3:::my-website-bucket-57984937/*"
                      + Sid       = "PublicReadGetObject"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + region = "ap-south-1"
    }

  # module.website_s3_bucket.aws_s3_bucket_public_access_block.this will be created
  + resource "aws_s3_bucket_public_access_block" "this" {
      + block_public_acls       = false
      + block_public_policy     = false
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = false
      + region                  = "ap-south-1"
      + restrict_public_buckets = false
    }

  # module.website_s3_bucket.aws_s3_bucket_server_side_encryption_configuration.this will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "this" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + region = "ap-south-1"

      + rule {
          + apply_server_side_encryption_by_default {
              + sse_algorithm     = "AES256"
                # (1 unchanged attribute hidden)
            }
        }
    }

  # module.website_s3_bucket.aws_s3_bucket_versioning.this will be created
  + resource "aws_s3_bucket_versioning" "this" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + region = "ap-south-1"

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

  # module.website_s3_bucket.aws_s3_bucket_website_configuration.this[0] will be created
  + resource "aws_s3_bucket_website_configuration" "this" {
      + bucket           = (known after apply)
      + id               = (known after apply)
      + region           = "ap-south-1"
      + routing_rules    = (known after apply)
      + website_domain   = (known after apply)
      + website_endpoint = (known after apply)

      + error_document {
          + key = "error.html"
        }

      + index_document {
          + suffix = "index.html"
        }

      + routing_rule (known after apply)
    }

Plan: 16 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ advanced_bucket_info = {
      ~ arn                  = "arn:aws:s3:::my-advanced-bucket-57984937" -> (known after apply)
      ~ domain_name          = "my-advanced-bucket-57984937.s3.amazonaws.com" -> (known after apply)
      ~ id                   = "my-advanced-bucket-57984937" -> (known after apply)
      ~ regional_domain_name = "my-advanced-bucket-57984937.s3.ap-south-1.amazonaws.com" -> (known after apply)
    }
  ~ basic_bucket_info    = {
      ~ arn                  = "arn:aws:s3:::my-basic-bucket-57984937" -> (known after apply)
      ~ domain_name          = "my-basic-bucket-57984937.s3.amazonaws.com" -> (known after apply)
      ~ id                   = "my-basic-bucket-57984937" -> (known after apply)
      ~ regional_domain_name = "my-basic-bucket-57984937.s3.ap-south-1.amazonaws.com" -> (known after apply)
    }
  ~ website_bucket_info  = {
      ~ arn              = "arn:aws:s3:::my-website-bucket-57984937" -> (known after apply)
      ~ id               = "my-website-bucket-57984937" -> (known after apply)
      ~ website_domain   = "s3-website.ap-south-1.amazonaws.com" -> (known after apply)
      ~ website_endpoint = "my-website-bucket-57984937.s3-website.ap-south-1.amazonaws.com" -> (known after apply)
    }
```